app/controllers/chart_instances_controller.rb

  def show
    @chart_instance = @chart.chart_instances.find(params[:id])
---
SELECT * FROM "charts" WHERE ("charts"."id" = 1)

  def load_chart
  	@chart = Chart.find(params[:chart_id])
---
SELECT * FROM "charts" WHERE ("charts"."id" = 1)