app/controllers/chart_instance_items_controller.rb

  def show
    @chart_instance_item = @chart_instance.chart_instance_items.find(params[:id])
---
SELECT * FROM "chart_instance_items" WHERE ("chart_instance_items"."id" = 980190962)

  def load_chart_instance
  	@chart = Chart.find(params[:chart_id])
  	@chart_instance = @chart.chart_instances.find(params[:chart_instance_id])
---
SELECT * FROM "chart_instances" WHERE ("chart_instances"."id" = 1) ORDER BY date ASC