app/controllers/charts_controller.rb

SELECT * FROM "charts"
---
  def index
    @charts = Chart.all

SELECT * FROM "charts" WHERE ("charts"."id" = 1)
---
  def show
    @chart = Chart.find(params[:id])

SELECT * FROM "charts" WHERE ("charts"."id" = 980190962)
---
  def edit
    @chart = Chart.find(params[:id])

INSERT INTO "charts" ("created_at", "size", "title", "updated_at", "url", "chart_type", "items_per_page") VALUES('2010-11-07 04:06:12', 200, 'Billboard 200', '2010-11-07 04:06:12', 'http://www.billboard.com/charts/billboard-200', 'Albums', 20)
---
  def create
    @chart = Chart.new(params[:chart])

    respond_to do |format|
      if @chart.save

SELECT * FROM "charts" WHERE ("charts"."id" = 980190962)
---
  def update
    @chart = Chart.find(params[:id])

SELECT * FROM "charts" WHERE ("charts"."id" = 980190962)
DELETE FROM "charts" WHERE "id" = 980190962
---
  def destroy
    @chart = Chart.find(params[:id])
    @chart.destroy