app/controllers/chart_instances_controller.rb

SELECT * FROM "chart_instances" ORDER BY date ASC
---
  def index
    @chart_instances = ChartInstance.all

SELECT * FROM "chart_instances" WHERE ("chart_instances"."id" = 38) ORDER BY date ASC
---
  def show
    @chart_instance = ChartInstance.find(params[:id])