app/controllers/chart_instance_items_controller.rb

  def index
    @chart_instance_items = ChartInstanceItem.all
---
SELECT * FROM "chart_instance_items"